podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/FMC_MK82F25615.svd.xml
<!--
Devices using this peripheral: 
      MK82F25615
-->
      <peripheral>
         <?sourceFile "FMC_MK82F25615" ?>
         <name>FMC</name>
         <description>Flash Memory Controller</description>
         <groupName>FMC</groupName>
         <prependToName>FMC_</prependToName>
         <headerStructName>FMC</headerStructName>
         <baseAddress>0x4001F000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x100</offset>
            <size>0x40</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x200</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PFAPR</name>
               <description>Flash Access Protection Register</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x3F</resetValue>
               <fields>
                  <field>
                     <name>M0AP</name>
                     <description>Master 0 Access Protection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>No access may be performed by this master</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Only read accesses may be performed by this master</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Only write accesses may be performed by this master</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Both read and write accesses may be performed by this master</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="M0AP" > <name>M1AP</name> <description>Master 1 Access Protection</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="M0AP" > <name>M2AP</name> <description>Master 2 Access Protection</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="M0AP" > <name>M3AP</name> <description>Master 3 Access Protection</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="M0AP" > <name>M4AP</name> <description>Master 4 Access Protection</description> <bitOffset>8</bitOffset> </field>
                  <field>
                     <name>M0PFD</name>
                     <description>Master 0 Prefetch Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Prefetching for this master is enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Prefetching for this master is disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="M0PFD" > <name>M1PFD</name> <description>Master 1 Prefetch Disable</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="M0PFD" > <name>M2PFD</name> <description>Master 2 Prefetch Disable</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="M0PFD" > <name>M3PFD</name> <description>Master 3 Prefetch Disable</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="M0PFD" > <name>M4PFD</name> <description>Master 4 Prefetch Disable</description> <bitOffset>20</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PFB0CR</name>
               <description>Flash Bank 0 Control Register</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x3004001F</resetValue>
               <fields>
                  <field>
                     <name>B0SEBE</name>
                     <description>Bank 0 Single Entry Buffer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Single entry buffer is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Single entry buffer is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0IPE</name>
                     <description>Bank 0 Instruction Prefetch Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Do not prefetch in response to instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable prefetches in response to instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0DPE</name>
                     <description>Bank 0 Data Prefetch Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Do not prefetch in response to data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable prefetches in response to data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0ICE</name>
                     <description>Bank 0 Instruction Cache Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Do not cache instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Cache instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0DCE</name>
                     <description>Bank 0 Data Cache Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Do not cache data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Cache data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRC</name>
                     <description>Cache Replacement Control</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>LRU replacement algorithm per set across all four ways</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Independent LRU with ways [0-1] for ifetches, [2-3] for data</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Independent LRU with ways [0-2] for ifetches, [3] for data</description>
                           <value>0b011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0MW</name>
                     <description>Bank 0 Memory Width</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>32 bits</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>64 bits</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>128 bits</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>S_B_INV</name>
                     <description>Invalidate Prefetch Speculation Buffer</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Speculation buffer and single entry buffer are not affected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Invalidate (clear) speculation buffer and single entry buffer</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CINV_WAY</name>
                     <description>Cache Invalidate Way x</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No cache way invalidation for the corresponding cache</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Invalidate cache way for the corresponding cache: clear the tag, data, and vld bits of ways selected</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLCK_WAY</name>
                     <description>Cache Lock Way x</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Cache way is unlocked and may be displaced</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Cache way is locked and its contents are not displaced</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B0RWSC</name>
                     <description>Bank 0 Read Wait State Control</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>Reserved</name>
               <description>Reserved</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x30000000</resetValue>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>16</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>TAGVDW,@pTAGVDW@i@f</name>
               <addressOffset>0x100</addressOffset>
               <register>
                  <dim>4</dim>
                  <dimIncrement>4</dimIncrement>
                  <dimIndex>0,1,2,3</dimIndex>
                  <name>S%s</name>
                  <description>Cache Tag Storage</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>valid</name>
                        <description>1-bit valid for cache entry</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>cache_tag</name>
                        <description>14-bit tag for cache entry</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <dim>4</dim>
               <dimIncrement>64</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>DATAW,@pDATAW@i@f</name>
               <addressOffset>0x200</addressOffset>
               <register>
                  <name>S0UM</name>
                  <description>Cache Data Storage (uppermost word)</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [127:96] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S0MU</name>
                  <description>Cache Data Storage (mid-upper word)</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [95:64] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S0ML</name>
                  <description>Cache Data Storage (mid-lower word)</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S0LM</name>
                  <description>Cache Data Storage (lowermost word)</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S1UM</name>
                  <description>Cache Data Storage (uppermost word)</description>
                  <addressOffset>0x10</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [127:96] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S1MU</name>
                  <description>Cache Data Storage (mid-upper word)</description>
                  <addressOffset>0x14</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [95:64] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S1ML</name>
                  <description>Cache Data Storage (mid-lower word)</description>
                  <addressOffset>0x18</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S1LM</name>
                  <description>Cache Data Storage (lowermost word)</description>
                  <addressOffset>0x1C</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S2UM</name>
                  <description>Cache Data Storage (uppermost word)</description>
                  <addressOffset>0x20</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [127:96] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S2MU</name>
                  <description>Cache Data Storage (mid-upper word)</description>
                  <addressOffset>0x24</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [95:64] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S2ML</name>
                  <description>Cache Data Storage (mid-lower word)</description>
                  <addressOffset>0x28</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S2LM</name>
                  <description>Cache Data Storage (lowermost word)</description>
                  <addressOffset>0x2C</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3UM</name>
                  <description>Cache Data Storage (uppermost word)</description>
                  <addressOffset>0x30</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [127:96] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3MU</name>
                  <description>Cache Data Storage (mid-upper word)</description>
                  <addressOffset>0x34</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [95:64] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3ML</name>
                  <description>Cache Data Storage (mid-lower word)</description>
                  <addressOffset>0x38</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3LM</name>
                  <description>Cache Data Storage (lowermost word)</description>
                  <addressOffset>0x3C</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
